In [1]:
import pandas as pd

In [3]:
df = pd.Series([4,8,15,16,23.42])

In [4]:
df

0     4.00
1     8.00
2    15.00
3    16.00
4    23.42
dtype: float64

In [5]:
type(df)

pandas.core.series.Series

In [17]:
#2
l= [1,2,3,4,5,6,7,8,9,10]
ser = pd.Series(l)
print(l)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [18]:
#3
data = {'Name':['Alice','Bob','Claire'],
        'age':[25,30,27],
        'gender':['female','male','female']}
df1 = pd.DataFrame(data)
print(df1.set_index('Name'))

        age  gender
Name
Alice    25  female
Bob      30    male
Claire   27  female

#4
In Pandas, a DataFrame is a two-dimensional data structure that can store data of different data types in columns. It can be thought of as a table, where each column represents a variable, and each row represents an observation or a record.
a DataFrame is a table with rows and columns, where each column can be of a different data type (such as integer, float, string, boolean, etc.). It is a powerful data structure in Pandas that allows us to manipulate and analyze data efficiently.

In [14]:
import pandas as pd

data = {'Name': ['raju', 'papu', 'jeeban', 'shiva', 'sekher'],
        'Height': [165, 180, 170, 175, 160],
        'Weight': [60, 80, 70, 75, 55]}

df = pd.DataFrame(data)
print(df)

     Name  Height  Weight
0    raju     165      60
1    papu     180      80
2  jeeban     170      70
3   shiva     175      75
4  sekher     160      55

differences between DataFrames and Series:
1.Dimensionality: DataFrames are two-dimensional data structures, whereas Series are one-dimensional data structures.

2.Labeling: Both DataFrames and Series can have row and column labels, but a Series only has row labels, while a DataFrame has both row and column labels.

3.Data types: Series can hold any data type (numeric, string, boolean, etc.), while DataFrames are typically composed of multiple Series objects, each of which can have its own data type.

4.Size: DataFrames are typically larger than Series because they contain multiple columns of data.

5.Operations: DataFrames and Series have different operations available to them. For example, you can perform arithmetic operations on a Series, but you can also perform aggregation functions like mean and sum on a DataFrame.

DataFrames and Series are both important components of the Pandas library and are used extensively for data manipulation, analysis, and visualization.

#5- 
for manupulation of data in pandas.Dataframe we use several funtion like - head() ,tail() , info(), describe(), drop(), fillna(), groupby(), merge() , pivot_table(), sort_value(), apply(), rename() etc.

In [20]:
df4 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
d1=df4.describe()
d1

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#6
In Pandas, both Series and DataFrames are mutable in nature. This means that you can change the values within a Series or a DataFrame after it has been created.

 we can add or remove rows and columns from a DataFrame, or change the values within a Series using indexing or assignment.
 
 Panel is a three-dimensional data structure in Pandas that is used to store data with three or more dimensions. However, unlike Series and DataFrames, Panels are generally not used as frequently in Pandas and are considered less flexible and efficient.

In [28]:
#7
name = pd.Series(['rajesh','kunal','raghab','satya','shiva'])
age = pd.Series([23,25,34,29,43])
height = pd.Series([164,160,172,163,169])
weight= pd.Series([60,65,55,72,79])

df = pd.concat([name ,age ,height,weight],axis=1)
df.columns=['name' ,'age' ,'height','weight']
print(df)

     name  age  height  weight
0  rajesh   23     164      60
1   kunal   25     160      65
2  raghab   34     172      55
3   satya   29     163      72
4   shiva   43     169      79

In [27]:
df

     name  age  height  weight
0  rajesh   23     164      60
1   kunal   25     160      65
2  raghab   34     172      55
3   satya   29     163      72
4   shiva   43     169      79